Repository: oleksandrmelnychenko/Ecliptix-Web-Server
Catalog: Ecliptix.Core/Resources/VerificationFlowRes.*.resx
Languages: uk_ua

# verification_flow_conflict_resolved_to_existing
source: Existing session found; please continue.
uk_ua: Знайдено активну сесію; будь ласка, продовжуйте.

# verification_flow_conflict_unresolved
source: Session conflict; please try again.
uk_ua: Конфлікт сесій; будь ласка, спробуйте ще раз.

# verification_flow_reused_and_updated
source: Existing session updated; please continue.
uk_ua: Існуючу сесію оновлено; будь ласка, продовжуйте.

# verification_flow_conflict
source: Active session exists; finish or cancel first.
uk_ua: Активна сесія існує, завершіть або скасуйте її.

# verification_flow_not_found
source: Session not found; start over.
uk_ua: Сесію не знайдено, почніть знову.

# verification_flow_not_verified
source: Session not verified; please complete verification.
uk_ua: Сесію не підтверджено; будь ласка, завершіть перевірку.

# verification_session_not_found
source: Verification details not found; please retry.
uk_ua: Дані для перевірки не знайдено; будь ласка, повторіть спробу.

# otp_invalid
source: Invalid OTP; try again.
uk_ua: Недійсний OTP, спробуйте ще раз.

# otp_expired
source: OTP expired; request a new one.
uk_ua: OTP прострочено, запросіть новий.

# otp_generation_failed
source: OTP couldn't be generated; try again.
uk_ua: Не вдалося створити OTP, спробуйте ще раз.

# otp_max_attempts_reached
source: Too many OTP attempts; wait or contact support.
uk_ua: Забагато спроб OTP, зачекайте або зверніться до підтримки.

# otp_not_verified
source: OTP not verified; please enter the code.
uk_ua: OTP не підтверджено; будь ласка, введіть код.

# phone_invalid
source: Invalid phone number; please check.
uk_ua: Недійсний номер телефону, перевірте його.

# sms_send_failed
source: SMS failed; check number or retry.
uk_ua: SMS не надіслано, перевірте номер або повторіть.

# data_concurrency_conflict
source: Data updated; refresh and retry.
uk_ua: Дані оновлено, оновіть і повторіть.

# data_access_failed
source: Data access issue; try again later.
uk_ua: Проблема з доступом до даних, спробуйте пізніше.

# security_rate_limit_exceeded
source: Too many requests; wait and retry.
uk_ua: Забагато запитів, зачекайте і повторіть.

# security_suspicious_activity
source: Unusual activity detected; access restricted.
uk_ua: Виявлено підозрілу активність, доступ обмежено.

# membership_too_many_attempts
source: Too many membership attempts; wait {0} min or contact support.
uk_ua: Забагато спроб членства, зачекайте {0} хв або зверніться до підтримки.

# signin_too_many_attempts
source: Too many sign-in attempts; wait {0} min or contact support.
uk_ua: Забагато спроб входу, зачекайте {0} хв або зверніться до підтримки.

# activity_status_invalid
source: Invalid activity status.
uk_ua: Недійсний статус активності.

# app_device_created_but_invalid_id
source: Device registered but ID issue; contact support.
uk_ua: Додаток створено, але ID недійсний.

# app_device_invalid_id
source: Invalid app device ID.
uk_ua: Недійсний ID додатку.

# associated
source: Phone number associated successfully.
uk_ua: Номер телефону успішно прив'язано.

# phone_cannot_be_empty
source: Phone number cannot be empty.
uk_ua: Номер телефону не може бути порожнім.

# created_and_associated
source: Phone number created and associated.
uk_ua: Номер телефону створено та прив'язано.

# exists
source: Phone number already exists.
uk_ua: Номер телефону вже існує.

# phone_number_not_found
source: Phone number not found for login.
uk_ua: Номер телефону для входу не знайдено.

# phone_not_found
source: Phone number not found.
uk_ua: Номер телефону не знайдено.

# validation_failed
source: Form errors; check highlighted fields.
uk_ua: Помилки у формі, перевірте виділені поля.

# invalid_credentials
source: Invalid username or password.
uk_ua: Неправильне ім'я користувача або пароль.

# password_complexity_requirements
source: Password must be {0}+ chars with upper, lower, number, special.
uk_ua: Пароль має бути {0}+ символів із великими, малими, цифрами, спеціальними.

# password_empty
source: Password required.
uk_ua: Пароль потрібен.

# password_hash_error
source: Password processing error; retry.
uk_ua: Помилка обробки пароля, повторіть.

# password_hash_input_empty
source: Password processing failed; retry.
uk_ua: Не вдалося обробити пароль, повторіть.

# password_invalid_chars
source: Invalid characters in password.
uk_ua: Недійсні символи в паролі.

# password_config_hash_algorithm_unsupported
source: Password setup error; contact support.
uk_ua: Помилка налаштування пароля, зверніться до підтримки.

# password_config_iterations_invalid
source: Password setup issue; contact support.
uk_ua: Проблема з налаштуванням пароля, зверніться до підтримки.

# password_config_salt_size_invalid
source: Password config issue; contact support.
uk_ua: Проблема з конфігурацією пароля, зверніться до підтримки.

# password_missing_digit
source: Add a number.
uk_ua: Додайте цифру.

# password_missing_lowercase
source: Add lowercase letter.
uk_ua: Додайте малу літеру.

# password_missing_special_char
source: Add special character.
uk_ua: Додайте спеціальний символ.

# password_missing_uppercase
source: Add uppercase letter.
uk_ua: Додайте велику літеру.

# password_too_short
source: Password too short; min {0} chars.
uk_ua: Пароль закороткий, мін. {0} символів.

# password_verify_base64_error
source: Verification error; retry.
uk_ua: Помилка перевірки, повторіть.

# password_verify_error
source: Verification failed; retry.
uk_ua: Перевірка не вдалася, повторіть.

# password_verify_hash_size_mismatch
source: Verification mismatch; retry.
uk_ua: Невідповідність перевірки, повторіть.

# password_verify_input_empty
source: Verification failed; retry.
uk_ua: Перевірка не вдалася, повторіть.

# password_verify_invalid_format
source: Format error in verification; retry.
uk_ua: Помилка формату перевірки, повторіть.

# password_verify_mismatch
source: Incorrect password.
uk_ua: Неправильний пароль.

# password_verify_salt_size_mismatch
source: Verification mismatch; retry.
uk_ua: Невідповідність перевірки, повторіть.

# password_verify_stored_hash_empty
source: Verification issue; retry.
uk_ua: Проблема з перевіркою, повторіть.

# inactive_membership
source: Membership is inactive.
uk_ua: Членство неактивне.

# invalid_secure_key
source: Invalid secure key provided.
uk_ua: Надано недійсний ключ безпеки.

source: Membership already exists.
uk_ua: Членство вже існує.

source: Membership not found.
uk_ua: Членство не знайдено.

source: Secure key cannot be empty.
uk_ua: Ключ безпеки не може бути порожнім.

# secure_key_not_set
source: Secure key not set up for this membership.
uk_ua: Ключ безпеки для цього членства не встановлено.

# secure_key_too_long
source: Secure key is too long.
uk_ua: Ключ безпеки задовгий.

# secure_key_updated
source: Secure key updated successfully.
uk_ua: Ключ безпеки успішно оновлено.

# created
source: Successfully created.
uk_ua: Успішно створено.

# generic_error
source: Unexpected error; try again later.
uk_ua: Несподівана помилка, спробуйте пізніше.

# generic_no_result_returned
source: No result returned; try again.
uk_ua: Результат не повернуто; спробуйте ще раз.

# generic_success
source: Operation successful.
uk_ua: Операція успішна.

# generic_unexpected_outcome
source: Unexpected outcome occurred; try again.
uk_ua: Несподіваний результат; спробуйте ще раз.

# phone_parsing_invalid_country_code
source: Invalid country code in phone number.
uk_ua: Недійсний код країни в номері телефону.

# phone_parsing_too_short
source: Phone number is too short.
uk_ua: Номер телефону закороткий.

# phone_parsing_too_long
source: Phone number is too long.
uk_ua: Номер телефону задовгий.

# phone_parsing_invalid_number
source: Phone number format is invalid.
uk_ua: Неправильний формат номера телефону.

# phone_parsing_possible_but_local_only
source: Number might be valid locally; add country code or region.
uk_ua: Номер може бути дійсним локально; додайте код країни або регіон.

# phone_parsing_generic_error
source: Error parsing phone number.
uk_ua: Помилка розбору номера телефону.

# phone_validation_unexpected_error
source: Unexpected error validating phone number.
uk_ua: Несподівана помилка під час перевірки номера телефону.
